# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

**To put it simply grouped by allows you to group together rows based off of a column and then perform some sort of aggregate function on them.**

In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [2]:
df = pd.DataFrame(data)

For instance in this example here we have three partitions of IDS one two and three and then we have several values for them we can group by the ID column and aggregate them using some sort of aggregate function in every function is basically just a fancy term for any function that takes and many values and then spits out or outputs a single value such as taking the sum of a bunch of values and outputting the results or taking the average or standard deviation etc...

These are all aggregate function and that's all a group by method does it allows you to choose a column to Group By.

In [3]:
df.groupby('Company')

You can save this object as a new variable:

Now what we can do is use that group by method to group rows together based off of a column name for instance let's go ahead and group by the company I'm going to go on and say df.groypby and then call as a method and you pass in the column you want to group by this case.

In [4]:
by_comp = df.groupby("Company")

And then call aggregate methods off the object:

What I can do is store this as a new variable so I can say something like like come for my company and I have this group by object.

Then the second step of using Group By.

After you've grouped by that column is to go ahead and call some sort of aggregate function on it. So for example if I wanted to get the mean by company it would look at the sales column and give me the mean or average sale by the company.

In [6]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

The reason it can't do this for the person column is because these are strings and there's no way you can just take the mean of a string and that means panderers just automatically ignores anything that's a non-numeric column.

In [7]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

Likewise we can go ahead and perform other aggregate functions such as some of everything as far as sales per company.

More examples of aggregate methods:

In [9]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

And that means I could do stuff such as index offer so I could say by come up let's go ahead and sum up all the sales by company and that gives me the sales some of Facebook now a lot of times what you're going to be doing is not actually setting this group by object as a variable.

In [22]:
# In this way I called the variable firstly by_comp

by_comp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [23]:
# Another way using df.groupby

df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [10]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [11]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [12]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [13]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [25]:
# Another way

df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [14]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [15]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64